app/Http/Controllers/PostController.php

    public function index()
    {
    $post = Posts::where('active',1)->orderBy('created_at','desc')->paginate(5);
---
select * from `posts` where `active` = 1 order by `created_at` desc limit 5 offset 0
select count(*) as aggregate from `posts` where `active` = 1

    public function show_crud(Request $request)
    {
        $post = Posts::where('active',1)->orderBy('created_at','desc')->paginate(10);
---
select * from `posts` where `active` = 1 order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `posts` where `active` = 1